problems.org
#+TITLE: Problems
#+SETUPFILE: theme-readtheorg.setup
#+OPTIONS: num:nil

* Instructions
Each breakout room will take the problem that matches their room number. You will have 15 minutes to examine the given solution to the problem (java tutor link) and figure out how it works. Each group will have 5 minutes to explain how their problem solution works to the rest of the class.

The first link is to the CodingBat problem, the second link is to the provided solution implemented in java tutor. When you present, we will walk through the code using java tutor and you can explain what each step is doing.

You may use any resources you want. Don't stress, I will offer hints if necessary.
* Problems
** Problem 1
- [[https://codingbat.com/prob/p157733][Caught Speeding]]
- [[http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2850,%20false%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2861,%20false%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2883,%20false%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2883,%20true%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20int%20caughtSpeeding%28int%20speed,%20boolean%20isBirthday%29%20%7B%0A%20%20%20%20%20%20int%20bonus%20%3D%200%3B%0A%20%20%20%20%20%20if%20%28isBirthday%29%20%7B%0A%20%20%20%20%20%20%20%20bonus%20%3D%205%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20if%20%28speed%20-%20bonus%20%3C%2061%29%20%7B%0A%20%20%20%20%20%20%20%20return%200%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20else%20if%20%28speed%20-%20bonus%20%3C%2081%29%20%7B%0A%20%20%20%20%20%20%20%20return%201%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20else%20%7B%0A%20%20%20%20%20%20%20%20return%202%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%7D%0A%7D&cumulative=false&heapPrimitives=nevernest&mode=edit&origin=opt-frontend.js&py=java&rawInputLstJSON=%5B%5D&textReferences=false][Java Tutor]]
** Problem 2
- [[https://codingbat.com/prob/p137136][fizzString]]
- [[http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22floop%22%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22blob%22%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22heblo%22%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22flob%22%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20public%20String%20fizzString%28String%20str%29%20%7B%0A%20%20%20%20String%20result%20%3D%20%22%22%3B%0A%20%20%20%20if%20%28str.charAt%280%29%20%3D%3D%20'f'%29%20%7B%0A%20%20%20%20%20%20result%20%2B%3D%20%22Fizz%22%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20if%20%28str.charAt%28str.length%28%29-1%29%20%3D%3D%20'b'%29%20%7B%0A%20%20%20%20%20%20result%20%2B%3D%20%22Buzz%22%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20if%20%28result.equals%28%22%22%29%29%20%7B%0A%20%20%20%20%20%20result%20%3D%20str%3B%0A%20%20%20%20%7D%0A%20%20%0A%20%20%20%20return%20result%3B%0A%20%20%7D%0A%7D&cumulative=false&heapPrimitives=nevernest&mode=edit&origin=opt-frontend.js&py=java&rawInputLstJSON=%5B%5D&textReferences=false][Java Tutor]]
** Problem 3
- [[https://codingbat.com/prob/p177181][Tea Party]]
- [[http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.teaParty%283,%208%29%3B%0A%20%20%20%20%20%20t.teaParty%285,%208%29%3B%0A%20%20%20%20%20%20t.teaParty%285,%2010%29%3B%0A%20%20%20%20%20%20t.teaParty%2812,%205%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20int%20teaParty%28int%20tea,%20int%20candy%29%20%7B%0A%20%20%20%20%20%20if%20%28tea%20%3E%204%20%26%26%20candy%20%3E%204%29%20%7B%0A%20%20%20%20%20%20%20%20if%20%28tea%20%3E%3D%202%20*%20candy%20%7C%7C%202%20*%20tea%20%3C%3D%20candy%29%20%7B%0A%20%20%20%20%20%20%20%20%20%20return%202%3B%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20return%201%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20return%200%3B%0A%20%20%20%20%7D%0A%7D&cumulative=false&heapPrimitives=nevernest&mode=edit&origin=opt-frontend.js&py=java&rawInputLstJSON=%5B%5D&textReferences=false][Java Tutor]]
** Problem 4
- [[https://codingbat.com/prob/p153748][Share digit]]
- [[http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.shareDigit%282,%2012%29%3B%0A%20%20%20%20%20%20t.shareDigit%2824,35%29%3B%0A%20%20%20%20%20%20t.shareDigit%2814,%2041%29%3B%0A%20%20%20%20%20%20t.shareDigit%2834,%2041%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20boolean%20shareDigit%28int%20a,%20int%20b%29%20%7B%0A%20%20%20%20%20%20int%20a1%20%3D%20a/10%3B%0A%20%20%20%20%20%20int%20a2%20%3D%20a%2510%3B%0A%20%20%20%20%20%20int%20b1%20%3D%20b/10%3B%0A%20%20%20%20%20%20int%20b2%20%3D%20b%2510%3B%0A%20%20%0A%20%20%20%20%20%20return%20%28a1-b1%29*%28a2-b2%29*%28a1-b2%29*%28a2-b1%29%20%3D%3D%200%3B%0A%20%20%20%20%7D%0A%7D&cumulative=false&heapPrimitives=nevernest&mode=edit&origin=opt-frontend.js&py=java&rawInputLstJSON=%5B%5D&textReferences=false][Java Tutor]]
** Problem 5
- [[https://codingbat.com/prob/p118077][Sum Limit]]
- [[http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.sumLimit%282,%2012%29%3B%0A%20%20%20%20%20%20t.sumLimit%280,0%29%3B%0A%20%20%20%20%20%20t.sumLimit%2814,%2041%29%3B%0A%20%20%20%20%20%20t.sumLimit%2834,%2041%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20int%20sumLimit%28int%20a,%20int%20b%29%20%7B%0A%20%20%20%20%20%20int%20sum%20%3D%20a%2Bb%3B%0A%20%20%20%20%20%20if%20%28%28int%29%20Math.log10%28sum%29%20%3D%3D%20%28int%29%20Math.log10%28a%29%29%20%7B%0A%20%20%20%20%20%20%20%20return%20sum%3B%0A%20%20%20%20%20%20%7D%20return%20a%3B%0A%7D%0A%0A%7D&cumulative=false&curInstr=19&heapPrimitives=nevernest&mode=display&origin=opt-frontend.js&py=java&rawInputLstJSON=%5B%5D&textReferences=false][Java Tutor]]
