docs/problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2021-02-16 Tue 22:28 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />

  <title>Problems</title>
  <meta name="generator" content="Org mode" />
  <meta name="author" content="Rik Bose" />
  <link rel="stylesheet" type="text/css" href=
  "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css" />
  <link rel="stylesheet" type="text/css" href=
  "https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />

</head>

<body>
  <div id="content">
    <h1 class="title">Problems</h1>

    <div id="table-of-contents">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents">
        <ul>
          <li><a href="#org64c3f9a">Instructions</a></li>

          <li>
            <a href="#orge4db5e3">Problems</a>

            <ul>
              <li><a href="#orgf944924">Problem 1</a></li>

              <li><a href="#orgee582d8">Problem 2</a></li>

              <li><a href="#org0c65141">Problem 3</a></li>

              <li><a href="#orgbf0aad8">Problem 4</a></li>

              <li><a href="#orgd3eda71">Problem 5</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-org64c3f9a" class="outline-2">
      <h2 id="org64c3f9a">Instructions</h2>

      <div class="outline-text-2" id="text-org64c3f9a">
        <p>Each breakout room will take the problem that matches
        their room number. You will have 15 minutes to examine the
        given solution to the problem (java tutor link) and figure
        out how it works. Each group will have 5 minutes to explain
        how their problem solution works to the rest of the
        class.</p>

        <p>The first link is to the CodingBat problem, the second
        link is to the provided solution implemented in java tutor.
        When you present, we will walk through the code using java
        tutor and you can explain what each step is doing.</p>

        <p>You may use any resources you want. Don&rsquo;t stress,
        I will offer hints if necessary.</p>
      </div>
    </div>

    <div id="outline-container-orge4db5e3" class="outline-2">
      <h2 id="orge4db5e3">Problems</h2>

      <div class="outline-text-2" id="text-orge4db5e3"></div>

      <div id="outline-container-orgf944924" class="outline-3">
        <h3 id="orgf944924">Problem 1</h3>

        <div class="outline-text-3" id="text-orgf944924">
          <ul class="org-ul">
            <li><a href="https://codingbat.com/prob/p157733">Caught
            Speeding</a></li>

            <li><a href=
            "http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2850,%20false%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2861,%20false%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2883,%20false%29%3B%0A%20%20%20%20%20%20t.caughtSpeeding%2883,%20true%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20int%20caughtSpeeding%28int%20speed,%20boolean%20isBirthday%29%20%7B%0A%20%20%20%20%20%20int%20bonus%20%3D%200%3B%0A%20%20%20%20%20%20if%20%28isBirthday%29%20%7B%0A%20%20%20%20%20%20%20%20bonus%20%3D%205%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%0A%20%20%20%20%20%20if%20%28speed%20-%20bonus%20%3C%2061%29%20%7B%0A%20%20%20%20%20%20%20%20return%200%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20else%20if%20%28speed%20-%20bonus%20%3C%2081%29%20%7B%0A%20%20%20%20%20%20%20%20return%201%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20else%20%7B%0A%20%20%20%20%20%20%20%20return%202%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%7D%0A%7D&amp;cumulative=false&amp;heapPrimitives=nevernest&amp;mode=edit&amp;origin=opt-frontend.js&amp;py=java&amp;rawInputLstJSON=%5B%5D&amp;textReferences=false">
            Java Tutor</a></li>
          </ul>
        </div>
      </div>

      <div id="outline-container-orgee582d8" class="outline-3">
        <h3 id="orgee582d8">Problem 2</h3>

        <div class="outline-text-3" id="text-orgee582d8">
          <ul class="org-ul">
            <li><a href=
            "https://codingbat.com/prob/p137136">fizzString</a></li>

            <li><a href=
            "http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22floop%22%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22blob%22%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22heblo%22%29%3B%0A%20%20%20%20%20%20t.fizzString%28%22flob%22%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20public%20String%20fizzString%28String%20str%29%20%7B%0A%20%20%20%20String%20result%20%3D%20%22%22%3B%0A%20%20%20%20if%20%28str.charAt%280%29%20%3D%3D%20'f'%29%20%7B%0A%20%20%20%20%20%20result%20%2B%3D%20%22Fizz%22%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20if%20%28str.charAt%28str.length%28%29-1%29%20%3D%3D%20'b'%29%20%7B%0A%20%20%20%20%20%20result%20%2B%3D%20%22Buzz%22%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20if%20%28result.equals%28%22%22%29%29%20%7B%0A%20%20%20%20%20%20result%20%3D%20str%3B%0A%20%20%20%20%7D%0A%20%20%0A%20%20%20%20return%20result%3B%0A%20%20%7D%0A%7D&amp;cumulative=false&amp;heapPrimitives=nevernest&amp;mode=edit&amp;origin=opt-frontend.js&amp;py=java&amp;rawInputLstJSON=%5B%5D&amp;textReferences=false">
            Java Tutor</a></li>
          </ul>
        </div>
      </div>

      <div id="outline-container-org0c65141" class="outline-3">
        <h3 id="org0c65141">Problem 3</h3>

        <div class="outline-text-3" id="text-org0c65141">
          <ul class="org-ul">
            <li><a href="https://codingbat.com/prob/p177181">Tea
            Party</a></li>

            <li><a href=
            "http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.teaParty%283,%208%29%3B%0A%20%20%20%20%20%20t.teaParty%285,%208%29%3B%0A%20%20%20%20%20%20t.teaParty%285,%2010%29%3B%0A%20%20%20%20%20%20t.teaParty%2812,%205%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20int%20teaParty%28int%20tea,%20int%20candy%29%20%7B%0A%20%20%20%20%20%20if%20%28tea%20%3E%204%20%26%26%20candy%20%3E%204%29%20%7B%0A%20%20%20%20%20%20%20%20if%20%28tea%20%3E%3D%202%20*%20candy%20%7C%7C%202%20*%20tea%20%3C%3D%20candy%29%20%7B%0A%20%20%20%20%20%20%20%20%20%20return%202%3B%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20return%201%3B%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20return%200%3B%0A%20%20%20%20%7D%0A%7D&amp;cumulative=false&amp;heapPrimitives=nevernest&amp;mode=edit&amp;origin=opt-frontend.js&amp;py=java&amp;rawInputLstJSON=%5B%5D&amp;textReferences=false">
            Java Tutor</a></li>
          </ul>
        </div>
      </div>

      <div id="outline-container-orgbf0aad8" class="outline-3">
        <h3 id="orgbf0aad8">Problem 4</h3>

        <div class="outline-text-3" id="text-orgbf0aad8">
          <ul class="org-ul">
            <li><a href="https://codingbat.com/prob/p153748">Share
            digit</a></li>

            <li><a href=
            "http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.shareDigit%282,%2012%29%3B%0A%20%20%20%20%20%20t.shareDigit%2824,35%29%3B%0A%20%20%20%20%20%20t.shareDigit%2814,%2041%29%3B%0A%20%20%20%20%20%20t.shareDigit%2834,%2041%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20boolean%20shareDigit%28int%20a,%20int%20b%29%20%7B%0A%20%20%20%20%20%20int%20a1%20%3D%20a/10%3B%0A%20%20%20%20%20%20int%20a2%20%3D%20a%2510%3B%0A%20%20%20%20%20%20int%20b1%20%3D%20b/10%3B%0A%20%20%20%20%20%20int%20b2%20%3D%20b%2510%3B%0A%20%20%0A%20%20%20%20%20%20return%20%28a1-b1%29*%28a2-b2%29*%28a1-b2%29*%28a2-b1%29%20%3D%3D%200%3B%0A%20%20%20%20%7D%0A%7D&amp;cumulative=false&amp;heapPrimitives=nevernest&amp;mode=edit&amp;origin=opt-frontend.js&amp;py=java&amp;rawInputLstJSON=%5B%5D&amp;textReferences=false">
            Java Tutor</a></li>
          </ul>
        </div>
      </div>

      <div id="outline-container-orgd3eda71" class="outline-3">
        <h3 id="orgd3eda71">Problem 5</h3>

        <div class="outline-text-3" id="text-orgd3eda71">
          <ul class="org-ul">
            <li><a href="https://codingbat.com/prob/p118077">Sum
            Limit</a></li>

            <li><a href=
            "http://pythontutor.com/java.html#code=public%20class%20Test%20%7B%0A%20%20%20%20public%20static%20void%20main%28String%5B%5D%20args%29%20%7B%0A%20%20%20%20%20%20Test%20t%20%3D%20new%20Test%28%29%3B%0A%20%20%20%20%20%20t.sumLimit%282,%2012%29%3B%0A%20%20%20%20%20%20t.sumLimit%280,0%29%3B%0A%20%20%20%20%20%20t.sumLimit%2814,%2041%29%3B%0A%20%20%20%20%20%20t.sumLimit%2834,%2041%29%3B%0A%20%20%20%20%7D%0A%20%20%20%20%0A%20%20%20%20public%20int%20sumLimit%28int%20a,%20int%20b%29%20%7B%0A%20%20%20%20%20%20int%20sum%20%3D%20a%2Bb%3B%0A%20%20%20%20%20%20if%20%28%28int%29%20Math.log10%28sum%29%20%3D%3D%20%28int%29%20Math.log10%28a%29%29%20%7B%0A%20%20%20%20%20%20%20%20return%20sum%3B%0A%20%20%20%20%20%20%7D%20return%20a%3B%0A%7D%0A%0A%7D&amp;cumulative=false&amp;curInstr=19&amp;heapPrimitives=nevernest&amp;mode=display&amp;origin=opt-frontend.js&amp;py=java&amp;rawInputLstJSON=%5B%5D&amp;textReferences=false">
            Java Tutor</a></li>
          </ul>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <p class="author">Author: Rik Bose</p>

    <p class="date">Created: 2021-02-16 Tue 22:28</p>
  </div>
</body>
</html>
